2022-01-30-what-is-falsehood.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.dasmith.xyz/rss.xml"
      title="RSS feed for https://www.dasmith.xyz/">
<title>What is Falsehood?</title>
<meta name="author" content="David Smith">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<link rel="apple-touch-icon-precomposed" href="static/favicon-152.png">
<link rel="msapplication-TitleImage" href="static/favicon-144.png">
<link rel="msapplication-TitleColor" href="#0141ff">
;;;; <link rel="stylesheet" href="static/katex.min.css">
;<meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://www.dasmith.xyz">David's Ramblings</a>
  <div class="sitelinks">
    <a href="https://www.dasmith.xyz">Home</a> | <a href="https://www.dasmith.xyz/about.html">About</a>
  </div>
 </div></div>
<div id="content">
<div class="post-date">30 Jan 2022</div><h1 class="post-title"><a href="https://www.dasmith.xyz/2022-01-30-what-is-falsehood.html">What is Falsehood?</a></h1>
<p>
“All generalizations are false, including this one.”—Mark Twain
</p>

<p>
If Truth is “in conformity to fact or reality”, there must be something <i>not</i> in conformity to fact or reality. And of course there is:
</p>

<p>
Falsehood \False&ldquo;hood\, n. [False + -hood]
</p>
<ol class="org-ol">
<li>Want of truth or accuracy; an untrue assertion or
representation; error; misrepresentation; falsity.</li>
<li>A deliberate intentional assertion of what is known to be
untrue; a departure from moral integrity; a lie.</li>
<li>Treachery; deceit; perfidy; unfaithfulness.</li>
<li>A counterfeit; a false appearance; an imposture.</li>
</ol>
<p>
Syn: Falsity; lie; untruth; fiction; fabrication.
</p>

<p>
And, like truth, there’s a lot of weeds to get into regarding falsehood. Oh, it doesn’t always have to be complicated. In software development, for instance, we use Boolean or bivalent logic to determine whether a value is, say, equal to or greater than 100. If it is, the answer is “true” (or 1 in computer speak) and if it isn’t, it’s “false” (or 0). Very straightforward and clean.
</p>

<p>
Once we introduce a human into the mix, though, it gets complicated very quickly. Ask a person an equally straightforward question — say, “Do you have twenty dollars with you?” and the reply is “No”. If the answer, whether it’s “yes” or “no” is true, accurate, “in conformity to fact or reality” we’ve arrived at end of story.
</p>

<p>
However, if the answer is not true, not “in conformity to fact or reality” things get a bit more complicated. If we got an inaccurate reply in the computer example, that’s an error and our code is faulty or there’s a hardware issue. However, if our friend did have twenty dollars and said “no”, or didn’t and said “yes”, then there are several possibilities.
</p>

<p>
A simple mistake is one — definition 1. above. She left home with $35 and bought a $15 book before we met up. That leaves $20 in her mind, but she forgot sales tax and that $20 is actually $18.45. Or, she may believe that we’ll think less of her if she’s not carrying at least $20 dollars, so she says that she does when she knows that she doesn’t. In other words, we’ve been lied to — definition 2.
</p>

<p>
More complicated than simple Boolean logic, but still fairly straightforward. Of course, because we’ve introduced humans into the picture, there are additional complications. For example, there’s the classic “Does this dress make my butt look big” or “Am I too old to be playing rock ‘n’ roll?” Of course, if you’re being asked either the answer may well be “Yes”, and a “No” answer would be a lie, but a complicated lie. The complication will have to do at least in part with motivation — a lie to avoid hurting someone’s feelings with no other consequences isn’t quite the same as an identical lie to harm the other person. Lies are complicated enough to deserve further exploration.
</p>

<p>
“Want of truth” and “an untrue assertion” in the definition eventually sends us back to the definition of “true”, which includes much more than “in conformity to fact or reality.” It also includes “conformity to rule”, “that which is true or certain concerning any matter or subject”, and “righteousness; true religion”.
</p>

<p>
These aspects of “truth” bring in context — truth in “conformity to rule” depends on which rule. Dribbling the ball is required in basketball, an error in American football.
</p>

<p>
“That which is true or certain concerning any matter or subject” depends on the subject. A true statement about gravity when the subject is Newtonian physics is false if the subject is switched to Einsteinian physics.
</p>

<p>
And, of course, “Righteousness; true religion” depends not only upon which religion, but which sect within a given religion.
</p>

<p>
So, it looks like, before we can get down and dirty with saying things that conform with reality, we may need to explore not-truth a bit more.
</p>
<div class="taglist"><a href="https://www.dasmith.xyz/tags.html">Tags</a>: <a href="https://www.dasmith.xyz/tag-truth.html">truth</a> </div></div>
<div id="postamble" class="status"><div id="archive">
  <a href="https://www.dasmith.xyz/archive.html">Other posts</a>
</div>
<center>David's Ramblings &#169; 2023 David Smith - Certified 100% AI-Free Content</center></div>
</body>
</html>
